#### 📖 Terraform Plan ('infra/resources/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.function_app.azurerm_storage_blob.featured_institutions must be replaced
-/+ resource "azurerm_storage_blob" "featured_institutions" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ content_md5            = "b83d9fedfccffd9718b0ec6144628b62" -> "1c710ae8452ff692f333e1a6b697d8c3" # forces replacement
      ~ id                     = "https://iopitnsvcappbestfn01.blob.core.windows.net/static-content/featured-institutions.json" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "featured-institutions.json"
      ~ url                    = "https://iopitnsvcappbestfn01.blob.core.windows.net/static-content/featured-institutions.json" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.function_app.azurerm_storage_blob.featured_services must be replaced
-/+ resource "azurerm_storage_blob" "featured_services" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ content_md5            = "3c766ae7ea7d894f0e6eba3be82596be" -> "2036ae9a8acbec733975f9e4c6c85610" # forces replacement
      ~ id                     = "https://iopitnsvcappbestfn01.blob.core.windows.net/static-content/featured-services.json" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "featured-services.json"
      ~ url                    = "https://iopitnsvcappbestfn01.blob.core.windows.net/static-content/featured-services.json" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Warning: Argument is deprecated

  with module.ai_search.module.srch_snet.azurerm_subnet.this,
  on .terraform/modules/ai_search.srch_snet/subnet/main.tf line 23, in resource "azurerm_subnet" "this":
  23:   private_endpoint_network_policies_enabled     = var.private_endpoint_network_policies_enabled

`private_endpoint_network_policies_enabled` will be removed in favour of the
property `private_endpoint_network_policies` in version 4.0 of the AzureRM
Provider

(and 5 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
